GreatCowBASIC/DATFileGenerator/incfiles/p16F18156.inc
;-----Bank14------------------
RC1REG           EQU  H'070C'
TX1REG           EQU  H'070D'
SP1BRG           EQU  H'070E'
SP1BRGL          EQU  H'070E'
SP1BRGH          EQU  H'070F'
RC1STA           EQU  H'0710'
TX1STA           EQU  H'0711'
BAUD1CON         EQU  H'0712'
RC2REG           EQU  H'0716'
TX2REG           EQU  H'0717'
SP2BRG           EQU  H'0718'
SP2BRGL          EQU  H'0718'
SP2BRGH          EQU  H'0719'
RC2STA           EQU  H'071A'
TX2STA           EQU  H'071B'
BAUD2CON         EQU  H'071C'

;-----Bank15------------------
SSP1BUF          EQU  H'078C'
SSP1ADD          EQU  H'078D'
SSP1MSK          EQU  H'078E'
SSP1STAT         EQU  H'078F'
SSP1CON1         EQU  H'0790'
SSP1CON2         EQU  H'0791'
SSP1CON3         EQU  H'0792'
SSP2BUF          EQU  H'0796'
SSP2ADD          EQU  H'0797'
SSP2MSK          EQU  H'0798'
SSP2STAT         EQU  H'0799'
SSP2CON1         EQU  H'079A'
SSP2CON2         EQU  H'079B'
SSP2CON3         EQU  H'079C'

;-----Bank16------------------
CM1CON0          EQU  H'080C'
CM1CON1          EQU  H'080D'
CM1NCH           EQU  H'080E'
CM1PCH           EQU  H'080F'
CM2CON0          EQU  H'0810'
CM2CON1          EQU  H'0811'
CM2NCH           EQU  H'0812'
CM2PCH           EQU  H'0813'
CMOUT            EQU  H'081F'
CMSTAT           EQU  H'081F'

;-----Bank17------------------
DAC1CON          EQU  H'088C'
DAC1DATL         EQU  H'088D'
DAC2CON          EQU  H'0890'
DAC2DATL         EQU  H'0891'

;-----Bank19------------------
PWM3ERS          EQU  H'098C'
PWM3CLK          EQU  H'098D'
PWM3LDS          EQU  H'098E'
PWM3PR           EQU  H'098F'
PWM3PRL          EQU  H'098F'
PWM3PRH          EQU  H'0990'
PWM3CPRE         EQU  H'0991'
PWM3PIPOS        EQU  H'0992'
PWM3GIR          EQU  H'0993'
PWM3GIE          EQU  H'0994'
PWM3CON          EQU  H'0995'
PWM3S1CFG        EQU  H'0996'
PWM3S1P1         EQU  H'0997'
PWM3S1P1L        EQU  H'0997'
PWM3S1P1H        EQU  H'0998'
PWM3S1P2         EQU  H'0999'
PWM3S1P2L        EQU  H'0999'
PWM3S1P2H        EQU  H'099A'

;-----Bank20------------------
PWM4ERS          EQU  H'0A0C'
PWM4CLK          EQU  H'0A0D'
PWM4LDS          EQU  H'0A0E'
PWM4PR           EQU  H'0A0F'
PWM4PRL          EQU  H'0A0F'
PWM4PRH          EQU  H'0A10'
PWM4CPRE         EQU  H'0A11'
PWM4PIPOS        EQU  H'0A12'
PWM4GIR          EQU  H'0A13'
PWM4GIE          EQU  H'0A14'
PWM4CON          EQU  H'0A15'
PWM4S1CFG        EQU  H'0A16'
PWM4S1P1         EQU  H'0A17'
PWM4S1P1L        EQU  H'0A17'
PWM4S1P1H        EQU  H'0A18'
PWM4S1P2         EQU  H'0A19'
PWM4S1P2L        EQU  H'0A19'
PWM4S1P2H        EQU  H'0A1A'

;-----Bank57------------------
NVMADR           EQU  H'1C8C'
NVMADRL          EQU  H'1C8C'
NVMADRH          EQU  H'1C8D'
NVMDAT           EQU  H'1C8E'
NVMDATL          EQU  H'1C8E'
NVMDATH          EQU  H'1C8F'
NVMCON1          EQU  H'1C90'
NVMCON2          EQU  H'1C91'
SCANHADR         EQU  H'1C92'
SCANHADRL        EQU  H'1C92'
SCANHADRH        EQU  H'1C93'
SCANLADR         EQU  H'1C95'
SCANLADRL        EQU  H'1C95'
SCANLADRH        EQU  H'1C96'
SCANCON0         EQU  H'1C98'
SCANTRIG         EQU  H'1C99'
CRCDATA          EQU  H'1C9A'
CRCDATAL         EQU  H'1C9A'
CRCDATAH         EQU  H'1C9B'
CRCDATAU         EQU  H'1C9C'
CRCDATAT         EQU  H'1C9D'
CRCOUT           EQU  H'1C9E'
CRCSHFT          EQU  H'1C9E'
CRCXOR           EQU  H'1C9E'
CRCOUTL          EQU  H'1C9E'
CRCSHFTL         EQU  H'1C9E'
CRCSHIFTL        EQU  H'1C9E'
CRCXORL          EQU  H'1C9E'
CRCOUTH          EQU  H'1C9F'
CRCSHFTH         EQU  H'1C9F'
CRCSHIFTH        EQU  H'1C9F'
CRCXORH          EQU  H'1C9F'
CRCOUTU          EQU  H'1CA0'
CRCSHFTU         EQU  H'1CA0'
CRCSHIFTU        EQU  H'1CA0'
CRCXORU          EQU  H'1CA0'
CRCOUTT          EQU  H'1CA1'
CRCSHFTT         EQU  H'1CA1'
CRCSHIFTT        EQU  H'1CA1'
CRCXORT          EQU  H'1CA1'
CRCCON0          EQU  H'1CA2'
CRCCON1          EQU  H'1CA3'
CRCCON2          EQU  H'1CA4'

;-----Bank58------------------
ADLTH            EQU  H'1D0C'
ADLTHL           EQU  H'1D0C'
ADLTHH           EQU  H'1D0D'
ADUTH            EQU  H'1D0E'
ADUTHL           EQU  H'1D0E'
ADUTHH           EQU  H'1D0F'
ADERR            EQU  H'1D10'
ADERRL           EQU  H'1D10'
ADERRH           EQU  H'1D11'
ADSTPT           EQU  H'1D12'
ADSTPTL          EQU  H'1D12'
ADSTPTH          EQU  H'1D13'
ADFLTR           EQU  H'1D14'
ADFLTRL          EQU  H'1D14'
ADFLTRH          EQU  H'1D15'
ADACC            EQU  H'1D16'
ADACCL           EQU  H'1D16'
ADACCH           EQU  H'1D17'
ADACCU           EQU  H'1D18'
ADCNT            EQU  H'1D19'
ADRPT            EQU  H'1D1A'
ADPREV           EQU  H'1D1B'
ADPREVL          EQU  H'1D1B'
ADPREVH          EQU  H'1D1C'
ADRES            EQU  H'1D1D'
ADRESL           EQU  H'1D1D'
ADRESH           EQU  H'1D1E'
ADPCH            EQU  H'1D1F'
ADNCH            EQU  H'1D20'
ADACQ            EQU  H'1D21'
ADACQL           EQU  H'1D21'
ADACQH           EQU  H'1D22'
ADCAP            EQU  H'1D23'
ADPRE            EQU  H'1D24'
ADPREL           EQU  H'1D24'
ADPREH           EQU  H'1D25'
ADCON0           EQU  H'1D26'
ADCON1           EQU  H'1D27'
ADCON2           EQU  H'1D28'
ADCON3           EQU  H'1D29'
ADSTAT           EQU  H'1D2A'
ADREF            EQU  H'1D2B'
ADACT            EQU  H'1D2C'
ADCLK            EQU  H'1D2D'
ADCG1A           EQU  H'1D2E'
ADCG1B           EQU  H'1D2F'
ADCG1C           EQU  H'1D30'

;-----Bank59------------------
RA0PPS           EQU  H'1D8C'
RA1PPS           EQU  H'1D8D'
RA2PPS           EQU  H'1D8E'
RA3PPS           EQU  H'1D8F'
RA4PPS           EQU  H'1D90'
RA5PPS           EQU  H'1D91'
RA6PPS           EQU  H'1D92'
RA7PPS           EQU  H'1D93'
RB0PPS           EQU  H'1D94'
RB1PPS           EQU  H'1D95'
RB2PPS           EQU  H'1D96'
RB3PPS           EQU  H'1D97'
RB4PPS           EQU  H'1D98'
RB5PPS           EQU  H'1D99'
RB6PPS           EQU  H'1D9A'
RB7PPS           EQU  H'1D9B'
RC0PPS           EQU  H'1D9C'
RC1PPS           EQU  H'1D9D'
RC2PPS           EQU  H'1D9E'
RC3PPS           EQU  H'1D9F'
RC4PPS           EQU  H'1DA0'
RC5PPS           EQU  H'1DA1'
RC6PPS           EQU  H'1DA2'
RC7PPS           EQU  H'1DA3'

;-----Bank60------------------
PPSLOCK          EQU  H'1E0C'
INTPPS           EQU  H'1E0D'
T0CKIPPS         EQU  H'1E0E'
T1CKIPPS         EQU  H'1E0F'
T1GPPS           EQU  H'1E10'
T3CKIPPS         EQU  H'1E11'
T3GPPS           EQU  H'1E12'
T2INPPS          EQU  H'1E19'
T4INPPS          EQU  H'1E1A'
T6INPPS          EQU  H'1E1B'
CCP1PPS          EQU  H'1E1E'
CCP2PPS          EQU  H'1E1F'
PWMIN0PPS        EQU  H'1E24'
PWMIN1PPS        EQU  H'1E25'
PWM1ERSPPS       EQU  H'1E26'
PWM2ERSPPS       EQU  H'1E27'
PWM3ERSPPS       EQU  H'1E28'
PWM4ERSPPS       EQU  H'1E29'
CWG1PPS          EQU  H'1E39'
CLCIN0PPS        EQU  H'1E3D'
CLCIN1PPS        EQU  H'1E3E'
CLCIN2PPS        EQU  H'1E3F'
CLCIN3PPS        EQU  H'1E40'
CK1PPS           EQU  H'1E41'
TX1CKPPS         EQU  H'1E41'
RX1PPS           EQU  H'1E42'
RX1DTPPS         EQU  H'1E42'

;-----Bank61------------------
CK2PPS           EQU  H'1E43'
TX2CKPPS         EQU  H'1E43'
RX2PPS           EQU  H'1E44'
RX2DTPPS         EQU  H'1E44'
SSP1CLKPPS       EQU  H'1E47'
SSP1DATPPS       EQU  H'1E48'
SSP1SSPPS        EQU  H'1E49'
SSP2CLKPPS       EQU  H'1E4A'
SSP2DATPPS       EQU  H'1E4B'
SSP2SSPPS        EQU  H'1E4C'
ADACTPPS         EQU  H'1E50'
ANSELA           EQU  H'1E8C'
WPUA             EQU  H'1E8D'
ODCONA           EQU  H'1E8E'
SLRCONA          EQU  H'1E8F'
INLVLA           EQU  H'1E90'
IOCAP            EQU  H'1E91'
IOCAN            EQU  H'1E92'
IOCAF            EQU  H'1E93'
ANSELB           EQU  H'1E96'
WPUB             EQU  H'1E97'
ODCONB           EQU  H'1E98'
SLRCONB          EQU  H'1E99'
INLVLB           EQU  H'1E9A'
IOCBP            EQU  H'1E9B'
IOCBN            EQU  H'1E9C'
IOCBF            EQU  H'1E9D'
ANSELC           EQU  H'1EA0'
WPUC             EQU  H'1EA1'
ODCONC           EQU  H'1EA2'
SLRCONC          EQU  H'1EA3'
INLVLC           EQU  H'1EA4'
IOCCP            EQU  H'1EA5'
IOCCN            EQU  H'1EA6'
IOCCF            EQU  H'1EA7'
WPUE             EQU  H'1EB5'
INLVLE           EQU  H'1EB8'
IOCEP            EQU  H'1EB9'
IOCEN            EQU  H'1EBA'
IOCEF            EQU  H'1EBB'

